package com.example.trips.ui.main

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class MainViewModel : ViewModel() {
    private val trips: MutableLiveData<List<Trip>> by lazy {
        MutableLiveData<List<Trip>>().run {
            loadTrips()
        }
    }

    fun getTrips(): LiveData<List<Trip>> {
        return trips
    }

    private fun loadTrips(): MutableLiveData<List<Trip>> {
        val temp: MutableLiveData<List<Trip>> = MutableLiveData()
        temp.value = tripList
        return temp
}

data class Trip(
    val id: String,
    val name: String,
    val desc: String,
    val location: String,
    val opened: String,
    val reviewUrl: String,
    val imageUrl: String
)

private val tripList = listOf(
        Trip(
            "1",
            "ตลาดพลู (กรุงเทพมหานคร)",
            "สำหรับชาวกรุงย่านฝั่งธนจะรู้กันดีว่า “ตลาดพลู” ถือเป็นแหล่งรวมความอร่อยที่มีร้านอาหารตลาดพลูเจ้าดัง ร้านเด็ดตลาดพลู และร้านเก่าแก่ตลาดพลูที่ขายกันมาตั้งแต่อดีตจนถึงปัจจุบันสืบต่อกันมาหลายรุ่น ราว ๆ 40-60 ปี บางร้านเนี่ยมีอายุถึง 130 ปีเลยก็มี อยู่กันมายาวนานขนาดนี้ก็ถือเป็นการการันตีความเด็ดแล้วใช่ไหมล่ะ !",
            "8 ถนนรัชดาภิเษก กรุงเทพมหานคร",
            "ทุกวัน 24 ชั่วโมง (แนะนำให้ไปช่วงเย็น ๆ)",
            "https://www.wongnai.com/trips/talat-phlu-trip",
            "https://img.wongnai.com/p/800x0/2020/12/03/ec71f4ca33ac42f3bc8a6d75c6f8e557.jpg"
        ),
        Trip(
            "2",
            "ดอยอินทนนท์ (จังหวัดเชียงใหม่)",
            "อยากเที่ยวหน้าหนาว ก็โบกมือลากรุงเทพฯกันไปได้เลย เพราะเราขอแนะนำให้ไปหนาวกันให้สุดที่ “ดอยอินทนนท์” ที่เที่ยวเชียงใหม่สูงสุดแดนสยาม ที่บอกเลยว่าเที่ยวง่าย วันเดียวก็ยังไหว เพราะอยู่ห่างจากสนามบินเชียงใหม่แค่ 2 ชั่วโมงเท่านั้นเอง ซึ่งถ้าใครได้ไปก็ขอแนะนำให้ไปตามเก็บให้ครบทั้งพระธาตุสวย จุดชมวิวสวย ๆ นาขั้นบันได น้ำตก แล้วอย่าลืมถ่ายรูปเก็บมาลงโซเชียลอวดเพื่อน ๆ กันเยอะ ๆ ด้วยน้า",
            "ถนนบ้านหลวง ซอย 2 เชียงใหม่",
            "ทุกวัน 06:00-18:00 น.",
            "https://www.wongnai.com/trips/one-day-trip-inthanon",
            "https://img.wongnai.com/p/800x0/2020/12/03/50a00ed174cf49538892f2192961fd29.jpg"
        ),
        Trip(
            "3",
            "ดอยเสมอดาว (จังหวัดน่าน)",
            "นักกางเต็นท์ทั้งหลายก็คงเคยไปเที่ยวที่เที่ยวไทยอย่าง “ดอยเสมอดาว” กันมาแล้วใช่ไหมล่ะคะ โดยเฉพาะนักล่าดาว ที่ดอยเสมอดาวถือเป็นจุดที่ตอนกลางคืนถ้าฟ้าเปิด เราจะสามารถเห็นดาวที่อยู่เต็มท้องฟ้าได้แบบชัด ๆ ซึ่งนั่นละคือเหตุผลที่ใครหลายคนอยากมาเช็กอิน ใครที่อยากเปลี่ยนบรรยากาศจากโรงแรมหรู ๆ มานอนนับดาวกับคนที่รัก ดอยเสมอดาวตอบโจทย์คุณแน่นอน",
            "ทางหลวงหมายเลข 1083 น่าน",
            "ทุกวัน 00:00-23:59 น.",
            "https://www.wongnai.com/trips/doi-samor-dao-nan",
            "https://img.wongnai.com/p/800x0/2020/12/03/3ecf97b726954d0bbadfeeeb1f7a30cd.jpg"
        ),
        Trip(
            "4",
            "ปาย (จังหวัดแม่ฮ่องสอน)",
            "ใครมองหาที่เที่ยวธรรมชาติ บรรยากาศดี สูดอากาศบริสุทธิ์ต้องห้ามพลาด \"ปาย\" เด็ดขาด นอกจากเป็นแหล่งท่องเที่ยวทางธรรมชาติแล้ว ปายก็ยังมีส่วนที่น่าสนใจหลาย ๆ อย่าง เช่น วิถีชุมชน ตลาดน้ำ ถนนคนเดิน ร้านค้าร้านอาหารที่มีชื่อเสียง จุดถ่ายรูปสไตล์วัยรุ่น จะหาโอกาสมาคนเดียวก็สนุก หรือมากับเพื่อน ๆ ก็เพลิน",
            "ทางหลวงหมายเลข 1095 แม่ฮ่องสอน",
            "ทุกวัน 00:00-23:59 น.",
            "https://www.wongnai.com/trips/weekend-at-pai",
            "https://img.wongnai.com/p/800x0/2020/12/03/353da7667f104ecab3be33905297785a.jpg"
        ),
        Trip(
            "5",
            "เขาค้อ (จังหวัดเพชรบูรณ์)",
            "ใครมองหาที่เที่ยวสวย ๆ ช่วงหน้าฝน ไปถึงต้นหนาว จะเป็นที่ไหนไปได้นอกจาก “เขาค้อ” เขาค้อนี่ถือเป็นที่เที่ยวไทยยอดนิยมที่หลาย ๆ คนนึกถึงเป็นชื่อแรกเลย ด้วยอากาศที่บริสุทธิ์ ความหนาวเย็น และบรรยากาศยามเช้า คงทำให้ใครหลายคนอยากมาสัมผัสที่นี่ แถมยังเดินทางจากกรุงเทพฯไม่นาน แค่ 2 ชั่วโมงนิด ๆ นอกจากนี้ยังมีสถานที่เที่ยวมากมาย ทั้งวัดพระธาตุผาซ่อนแก้ว, อนุสาวรีย์ผู้เสียสละเขาค้อ, ทุ่งกังหันลม มีใครหลายคนบอกว่านอนเขาค้อ 1 คืน อายุยืน 1 ปี ด้วยน้า",
            "ทางหลวงหมายเลข 2325 เพชรบูรณ์",
            "ทุกวัน 07:00-19:00 น.",
            "https://www.wongnai.com/trips/what-to-do-in-khao-kho",
            "https://img.wongnai.com/p/800x0/2020/12/03/c098e0f612cf4a56a7dd9ace53f8d0cc.jpg"
        ),
        Trip(
            "6",
            "ภูทับเบิก (จังหวัดเพชรบูรณ์)",
            "“ภูทับเบิก” นี่เป็นที่เที่ยวไทยที่พูดแล้วต้องร้องอ๋อจริง ๆ เพราะเขาฮิตไปกันเกือบทุกปีกับที่เที่ยวหน้าหนาวแห่งนี้ หลัก ๆ ก็เพราะวิวสวย ๆ และการเดินทางที่ไม่ไกล ได้บรรยากาศหนาว ๆ แบบไม่ต้องเดินทางไกลมาก แถมยังมีอากาศเย็น ๆ ตลอดปี กิจกรรมไฮไลต์เวลาไปที่ภูทับเบิก ก็จะมีทั้งการตื่นเช้ามาดูทะเลหมอก แล้วก็สั่งหมูกระทะมากินตอนเย็น ๆ ชิลแบบนี้นี่เองภูทับเบิกถึงกลายเป็นที่เที่ยวสุดฮิตแบบไร้ข้อกังขา!",
            "ทางหลวงหมายเลข 2331",
            "ทุกวัน 07:00-18:00 น.",
            "https://www.wongnai.com/trips/phuthapbuek-petchaboon",
            "https://img.wongnai.com/p/800x0/2020/12/03/79bd9f4839d84029a8cfb20a1cbebe18.jpg"
        ),
        Trip(
            "7",
            "เกาะล้าน (จังหวัดชลบุรี)",
            "“เกาะล้าน” อีกหนึ่งสถานที่ท่องเที่ยวไทยใกล้กรุงเทพฯ เดินทางง่าย แถมยังมีน้ำทะเลใสแจ๋วอย่างไม่น่าเชื่อ นอกจากเล่นน้ำได้แล้ว เกาะล้านก็ยังมีกิจกรรมอื่น ๆ เช่น ดำน้ำ ตกหมึก ขับเจ็ตสกี ฯลฯ อีกด้วย เรียกได้ว่า ไปเที่ยวได้สบายไม่ต้องรอวันหยุดยาว อยากรู้ว่าเกาะล้านเที่ยวสนุกคุ้มขนาดไหน ต้องหาโอกาสลองไปกันดูสักครั้งนะจ๊ะ ",
            "ทางหลวงหมายเลข 3 ชลบุรี",
            "ทุกวัน 08:00-16:00 น.",
            "https://www.wongnai.com/trips/what-to-do-in-koh-larn",
            "https://img.wongnai.com/p/800x0/2020/12/03/3c243416ecac4daebfa933b361e39643.jpg"
        ),
        Trip(
            "8",
            "ภูกระดึง (จังหวัดเลย)",
            "\"ครั้งหนึ่งในชีวิต เราคือภูพิชิตภูกระดึง\" เป็นประโยคบนป้ายที่เมื่อไปถึง ทุกคนจะต้องถ่ายภาพเก็บเป็นที่ระลึกไว้ เป็นที่เที่ยวที่เรียกได้ว่าเป็นจุดเริ่มต้นของสายเดินป่าเดินเขาเลยทีเดียว ที่เที่ยวยอดฮิตตลอดกาล ถึงแม้ปี 2021 แล้ว ก็แต่ยังเป็นที่เที่ยวห้ามพลาด ด้วยบรรยากาศที่เต็มไปด้วยธรรมชาติรายล้อม และจุดชมวิวที่สวยงามไม่แพ้ที่ไหน ทำให้ที่ \"ภูกระดึง\" แห่งนี้ยังเป็นที่เที่ยวที่ควรไปสักครั้ง",
            "ถนนอุทยานภูกระดึง เลย",
            "ทุกวัน 06:00-18:00 น.",
            "https://www.wongnai.com/trips/howto-reach-phu-kradueng",
            "https://img.wongnai.com/p/800x0/2020/12/04/a0868413bd7c4adfbf405bf6400c468a.jpg"
        ),
        Trip(
            "9",
            "เขาวงพระจันทร์ (จังหวัดลพบุรี)",
            "\"เขาวงพระจันทร์\" เป็นภูเขาที่สูงที่สุดที่อยู่คู่กับจังหวัดลพบุรีมาช้านาน มีความเชื่อว่าใครได้มานมัสการรอยพระพุทธบาทที่ประดิษฐานอยู่บนยอดเขา จะประสบความสุขสมหวังทุกประการ แต่ที่มีคู่มือเพราะกว่าจะถึงยอดเขานั้นเราต้องขึ้นบันไดไปกว่า 3,790 ขั้นเชียวละ",
            "ถนนพหลโยธิน ลพบุรี",
            "ทุกวัน 06:00-18:00 น.",
            "https://www.wongnai.com/trips/attraction-khao-wongphrachan-lopburi",
            "https://img.wongnai.com/p/800x0/2020/12/04/eaf189669e0f4782820b94af81efeb7e.jpg",
        ),
        Trip(
            "10",
            "ตลาดน้ำอัมพวา (จังหวัดสมุทรสงคราม)",
            "ถ้ามาอัมพวาแล้วไม่ได้มาตลาดน้ำก็เหมือนว่ามาไม่ถึงอัมพวา ที่เที่ยวยอดฮิตที่ใคร ๆ ก็พลาดไม่ได้กับ \"ตลาดน้ำอัมพวา\" บอกเลยว่าของกินที่นี่มีแต่ของอร่อย ๆ เพียบ เลือกกันไม่ถูกเลยทีเดียว แต่ก็ไม่ใช่ว่าจะมีแค่ของกินเพียงอย่างเดียว ยังมีของเล่นเก่า ๆ ขนมโบราณ และของฝากที่ระลึกน่ารัก ๆ ให้หิ้วติดไม้ติดมือกลับไปอีกด้วย ตลาดน้ำอัมพวาเปิดทุกวัน 10:00-21:00 น. ศุกร์-อาทิตย์ 14:00-21:00 น. บอกเลยว่าช่วงเย็น ๆ วันเสาร์-อาทิตย์ที่นี่จะคึกคักมาก ๆ ",
            "ถนนศรีอัมพวา สมุทรสงคราม",
            "ศุกร์-อาทิตย์ 14:00-21:00 น.",
            "https://www.wongnai.com/trips/amphawa-train-trip",
            "https://img.wongnai.com/p/800x0/2020/12/04/34318f079ef4413d8e9e0b9df7d1d505.jpg"
        )
    )
}